# x = 2
# x += 1.0
# print(type(x))
# print(type(2 - 2j))

# ********************************************************

# x = 0b1010111       # برای نوشتن اعداد در مبنای دو یا باینری از صفر بی استفاده میکنیم   
# y = 0o1245467       # برای نوشتن اعداد در مبنای هشت یا اکتا از صفر او استفاه میکنیم
# z = 0xABCDEF      # برای نوشتن اعداد در مبنای شانزده یا هگزادسیمال از صفر ایکس استفاده میکنیم

# print(x,type(x), sep=" - ")
# print(y,type(y), sep=" - ")
# print(z,type(z), sep=" - ")

# """
#     اعداد 10 به بالا در مبنای 16
#     A = 10, B = 11, C = 12, D = 13, E = 14, F = 15
# """

# ********************************************************

# x = 124
# y = 123456
# z = 98501445

# print(bin(x))       # چاپ عدد در مبنای 2 یا باینتری
# print(oct(y))       # چاپ عدد در مبنای 8 یا اکتادسیمال
# print(hex(z))       # چاپ عدد در مبنای 16 یا هگزادسیمال

# ********************************************************

# print(0.1 + 0.2 == 0.3)         # چون وقتی اعداد اعشاری تبدیل به باینری میشن و بعد دوباره از باینری تبدیل به اعشار، کمی ارقامشون متفاوت میشه 
# # در واقع ذخیره ی اعداد اعشاری در کامپیوتر یذره متفاوت تر از اعداد صحیح صورت میگیره
# # برای اینکه بتونیم عبارت بالارو دقیقا برابر با 0.3 قرار بدیم میتونیم از دو روش زیر کمک بگیریم

# # روش اول و حرفه ای:
# from decimal import Decimal
# print(Decimal(0.1) + Decimal(0.2))      # نتیجه رو دوباره مثل قبل نشون میده
# print(Decimal('0.1') + Decimal('0.2'))      # اگه بصورت رشته ای بنویسیم درست نشونش میده

# # روش دوم و ابتدایی:
# print(((0.1 * 10)+(0.2 * 10))/10)

# # برای اعداد 0.3 و 0.6 نیز به همین صورته
# ********************************************************

# # برای نمایش شکل کسری اعداد از کتابخانه Fractions استفاده میکنیم
# import fractions

# print(fractions.Fraction(1.5))

# ********************************************************
# x = 10_000_000_000_000_000_000_000_000_000_000_000          # برای اعدادی که تعداد ارقام بالایی دارند، میتونیم از آندراسکور استفاده کنیم به صورت سه تا سه تا
# print(x)

# # ********************************************************

# f = 2e+4         # 2 * 10 ** 4               # مقدار ای برابر است با 10 و هر عددی که بعدش میاد مثبت یا منفی یعنی توان
# g = 5e-8
# h = 9e700       # خروجی این میشه inf که به معنای infinity یا بی نهایت هستش

# print(f , g, h)

# ********************************************************

# c = 4 + 5j
# """
#     **اعداد مختلط**
#     به 4 میگن قسمت حقیقی و به 5 میگن قسمت موهومی
# """
# print(c)
# print(c.real)       # برای پرینت قسمت حقیقی
# print(c.imag)       # برای پرینت قسمت موهومی
# print(c.conjugate())      # برای پرینت مزدوجش

# ********************************************************

# """
#     توابع ریاضی:
#     1- تابع round : برای گرد کردن اعداد اعشاری
#     2- تابع abs : قدرمطلق
#     3- تابع pow : برای به توان رساندن
# """

# x = 52.35945641564
# print(round(x, 2))      # یعنی تا دو رقم اعشار گرد کن

# y = -78.21
# print(abs(y))

# z = 45
# print(pow(z , 8))

# ********************************************************
# تبدیل واحد از کیلوگرم به گرم
kg = int(input("Write the weight: "))
g = kg /1000
print(f"The weight in gram is = {g}")

# ********************************************************
