# x = int(input("Enter a number: "))
# y = x // 100
# t = (x % 100) // 10
# z = x % 10

# print(x , y , t , z, sep='\n')

# *******************************************************************
# مثال بالارو بصورت زیر هم میشه حلش کرد:
# x = int(input("Enter a number: "))
# temp = x % 10
# print(temp)
# x = x // 10
# temp = x % 10
# print(temp)
# x = x // 10
# temp = x % 10
# print(temp)

# *******************************************************************
# """
#     برنامه ای بنویسید که شعاع دایره را از کاربر گرفته و محیط و
#     مساحت دایره را حساب کند. 
# """
# import math
# r = int(input("Enter Shoa: "))
# masahat = math.pi * r * r
# mohit = 2 * r * math.pi
# print(f"Mohit dayereh barabar ast ba: {round(mohit,2)}\nmasahat barabar ast ba: {round(masahat,2)}")

# *******************************************************************
# """
#     برنامه ای بنویسید که یک عدد از کاربر گرفته و مربع)توان دوم(
#     و مکعب)توان سوم( آن را چاپ کند.
# """
# number = int(input("Enter your number: "))
# print(f"Tavan 2: {pow(number, 2)}\nTavan 3: {pow(number, 3)}")

# *******************************************************************
# """
#     برنامه ای بنویسید که دو عدد از کاربر گرفته، اول ی را به توان
#     دومی برساند و نتیجه را چاپ کند. 
# """
# x = int(input("Enter x: "))
# y = int(input("Enter y: "))
# print(pow(x, y))

# *******************************************************************
# """
#     برنامه ای بنویسید که سه عدد گرفته و م یانگین آن ها را
#     محاسبه و چاپ کند.
# """
# x = int(input("Enter x: "))
# y = int(input("Enter y: "))
# z = int(input("Enter z: "))
# print(average:=(x+y+z)/3)           # استفاده از عملگر والروس

# *******************************************************************
# """
#     برای چک کردن اینکه یک عبارت آیا نمونه ای از یک کلاس هست یا نه 
#     از تابع Isinstance
#     استفاده میکنیم
#     در واقع میتونیم با این تابع بیایم و تایپ هامون رو بررسی کنیم
# """

# x = 34
# print(isinstance(x , str))
# print(isinstance(x , int))
# print(isinstance(x , float))

# *******************************************************************
# # کاراکترهای ویژه

# """
#     \n, \t, \\ 
# """

# x = 'C:\Downloads\new\telegram\hi'
# y = 'C:\\Downloads\\new\\telegram\\hi'
# z = r'C:\Downloads\new\telegram\hi'     # برای اینکه کاراکترهای ویژه رو توی عبارتمون به حساب نیاره، پشت عبارتمون از حرف آر استفاده میکنیم
# print(x)
# print(y)
# print(z)

# *******************************************************************
# s = "mahsan gilani"

# print(s[1:7:2])
# print(len(s))
# print(s[len(s)-1])          # برای پرینت کاراکتر آخر
# # s[2] = "k"          # توی استرینگ ها نمیتونیم بصورت ایندکسی پارامتری رو تغییر بدیم، در نتیجه از این خط ارور میگیریم
# print(s)

# *******************************************************************
# # Methods in string:
# s = "mahsan"
# s = s.upper()
# print(s)
# s = s.lower()
# print(s)
# # **************************************************************************
# s = "mm ahsaan gilaanii"
# print(s.count('aa'))
# print(s.count(' '))
# print(s.count('a'))
# print(s.count('m'))
# print(s.count('i'))
# # **************************************************************************
# s = "mahsan gilani"
# print(s.endswith('i'))
# print(s.endswith('ani'))
# print(s.endswith('a'))
# # **************************************************************************
# print(s.startswith('mah'))
# print(s.startswith('MAH'))
# print(s.startswith(' '))
# print(s.startswith('hh'))
# # **************************************************************************

# print(s.find('a'))          # میره میگرده و به اولین ایندکسی که پارامتر a رو میبینه اعلامش میکنه
# print(s.find('an'))         
# print(s.find('cdghdg'))         # اگه پیدا نکنه منفی یک میزاره

# # یه متد دیگه هم داریم که میاد از سمت راست شروع به گشتن میکنه
# print(s.rfind('an'))
# print(s.rfind('n'))

# # **************************************************************************
# print(s.isalnum())            # داره میگه آیا همه ی کاراکترهایی که اینجا نوشته شده فقط از عدد و حروف تشکیل شده یا نه کاراکترهای دیگه هم هست
# # کلا تازمانیکه فقط حرف و عدد باشه مقدار ترو رو برمیگردونه
# # اما اگه حتی فقط یک - کوچیک هم داشته باشه مقدارش فالس میشه
# s = "mahsan"
# print(s.isalnum())
# s = "m234خمهسشا"
# print(s.isalnum())
# s = "ئبت -"
# print(s.isalnum())

# # **************************************************************************
# s = "12345668979"
# print(s.isnumeric())        # بررسی میکنه که آیا همه کاراکترهای وارد شده، عددی هستند یا خیر

# # **************************************************************************

# s = '*'
# l = ['a','b','5','-','Q']
# print(s.join(l))

# # **************************************************************************

# s = "I'm a bird and i wish you were my partner"
# print(s.split(' '))         # میاد بر اساس فاصله جداشون میکنه

# # **************************************************************************
# s = "I'm a bird and i wish you were my partner"

# print(s.replace('a','***'))         # میاد کاراکتر آ رو با ستاره جایگزین میکنه

# # **************************************************************************
# s = "       emshab che shabi ast shabe morad ast emshab          "
# print(s.strip())            # اگه توی پرانتز استریپ چیزی ننویسم میاد به صورت خودکار وایت اسپیس های اول و آخر جمله رو حذف میکنه

# s = "*********emshab che shabi ast shabe morad ast emshab***"
# print(s.strip('*'))

# s = "*********emshab che shabi ast shabe morad ast emshab+++++++"

# print(s.lstrip('*'))                # برای پاک کردن چیزمیزای ابتدایی از سمت چپ جمله
# print(s.rstrip('+'))                # برای پاک کردن چیزمیزای ابتدایی از سمت راست جمله

# # **************************************************************************
# s = "mahsan gilani"
# print(s.capitalize())           # بزرگ کردن اولین حرف عبارت

# # **************************************************************************
