# x = int(input("Enter a number: "))
# y = x // 100
# t = (x % 100) // 10
# z = x % 10

# print(x , y , t , z, sep='\n')

# *******************************************************************
# مثال بالارو بصورت زیر هم میشه حلش کرد:
# x = int(input("Enter a number: "))
# temp = x % 10
# print(temp)
# x = x // 10
# temp = x % 10
# print(temp)
# x = x // 10
# temp = x % 10
# print(temp)

# *******************************************************************
# """
#     برنامه ای بنویسید که شعاع دایره را از کاربر گرفته و محیط و
#     مساحت دایره را حساب کند. 
# """
# import math
# r = int(input("Enter Shoa: "))
# masahat = math.pi * r * r
# mohit = 2 * r * math.pi
# print(f"Mohit dayereh barabar ast ba: {round(mohit,2)}\nmasahat barabar ast ba: {round(masahat,2)}")

# *******************************************************************
# """
#     برنامه ای بنویسید که یک عدد از کاربر گرفته و مربع)توان دوم(
#     و مکعب)توان سوم( آن را چاپ کند.
# """
# number = int(input("Enter your number: "))
# print(f"Tavan 2: {pow(number, 2)}\nTavan 3: {pow(number, 3)}")

# *******************************************************************
# """
#     برنامه ای بنویسید که دو عدد از کاربر گرفته، اول ی را به توان
#     دومی برساند و نتیجه را چاپ کند. 
# """
# x = int(input("Enter x: "))
# y = int(input("Enter y: "))
# print(pow(x, y))

# *******************************************************************
# """
#     برنامه ای بنویسید که سه عدد گرفته و م یانگین آن ها را
#     محاسبه و چاپ کند.
# """
# x = int(input("Enter x: "))
# y = int(input("Enter y: "))
# z = int(input("Enter z: "))
# print(average:=(x+y+z)/3)           # استفاده از عملگر والروس

# *******************************************************************
"""
    برای چک کردن اینکه یک عبارت آیا نمونه ای از یک کلاس هست یا نه 
    از تابع Isinstance
    استفاده میکنیم
    در واقع میتونیم با این تابع بیایم و تایپ هامون رو بررسی کنیم
"""

x = 34
print(isinstance(x , str))
print(isinstance(x , int))
print(isinstance(x , float))

# *******************************************************************
