# """
#     برای بررسی اینکه یک حرف، کد یونیکد یا asciiاش چیه
#     از تابع ord استفاده میکنیم
# """
# x = 'A'
# print(ord(x))
# # ************************************************************************************
# """
#     همچنین برای فهمیدن اینکه یک کد یونیکد، چه حرفی هستش از تابع 
#     chr استفاده میکنیم
# """
# x = 65
# print(chr(65))
# # ************************************************************************************
# """
#     برای زمان هایی که یک کاراکتری توی کیبوردمون نیست، میتونیم بریم کاراکترش رو توی جدول های
#     یونیکد یا ascii پیدا کنیم و 
#     به شکل زیر با یک بک اسلش بنویسیم
#     توجه هم کنید که حروف ascii خیلی کمتر از یونیکد هستند
# """
# # از یو بزرگ برای 32 بیتی ها و از یو کوچک برای 16 بیتی ها استفاده میکنیم
# print('Char : \u0489')
# # ************************************************************************************
# """
#     کار \b پاک کردن یه حرف قبل هستش
#     در واقع همان backspace هستش
# """
# print("Hello\bWorld")

# # ************************************************************************************
# FORMATTING IN PYTHON
# x = 12
# y = 78.46547565663
# z = "Lili"
# # print("x is: {}\ny is: {}\nz is: {}".format(x , y , z))

# # # ************************************************************************************
# # ترتیب گذاشتن در فورمتینگ
# # باید حواسمون باشه که ترتیب ها با صفر باید شروع بشن
# print("x is: {1}\ny is: {2}\nz is: {0}".format(x , y , z))

# # ************************************************************************************
# d = {'x':5 , 'y':8, 'z':2.366}
# print("x is: {x}\ny is: {y}\nz is: {z}".format(**d))            # اگه بخوایم از دیکشنری استفاده کنیم لازمه که حتما قبلش دوتا ستاره بزاریم

# # ************************************************************************************
# # f-string
# """
#     در صورتیکه بخوایم یه حرفی توی آکولاد نشون داده بشه باید مجددا توی آکولاد قرارش بدیم
# """
# x = 23.2654
# print(f"{{x}} is {x}")
# print(f"{{x}} is {{{x}}}")
# # ************************************************************************************
# from datetime import datetime

# today = datetime.today()
# print(today)
# print(f"{today:%Y/%m/%d}")
# print(f"{today:%Y/%B/%d  %H:%M}")

# # ************************************************************************************
# # برای شمردن اینکه یک کاراکتر چند بار در متن زیر بکار رفته است، از تابع کانت استفاده میکنیم
# sentence = "American whole magazine truth stop whose. On traditional measure example sense peace. Would mouth relate own chair. Role together range line. Government first policy daughter."

# character = input("Enter a character: ")

# print(sentence.count(character))
# # ************************************************************************************
# # میخوایم یه جمله از کاربر بگیریم و بهش بگیم آخرین کلمه توی جمله ات فلان کلمه هستش
# sentence = input("write your sentence: ")
# sentence = (sentence.strip()).split(' ')
# print("----------------------------------------------------------------")
# print(f"your last word is : {sentence[len(sentence)-1]}")

# -----------------------------------------
# # راه حل سبزلرن برای مثال بالا:
# sentence = input("write your sentence: ").strip()
# i = sentence.rfind(" ")         # میره آخرین اسپیس رو از سمت راست پیدا میکنه، و آخرین کلمه دقیقا بعد از اون اسپیس هستش
# print(sentence[i+1:])

# # ************************************************************************************
# # میخوایم دوتا رشته بگیریم و بعد بررسی کنیم که آیا رشته دوم در رشته اول بکار رفته یا نه
# s1 = input("Enter a string: ")
# s2 = input("Enter a string: ")
# print(s2 in s1)

# # ************************************************************************************

# # کاربر یه متنی رو وارد کرده و حالا میخوایم تمامی اسپیس ها و چیزایی که وارد کرده رو از بین ببریم
# s = input("Enter a string: ")
# print(s.replace(' ','').replace('\t',''))           #یونیکدهای اسپیس و تب متفاوتن

# # ************************************************************************************
# # میخوایم از کاربری شماره تلفنشو بگیریم و بعد صفر اولشو پاک کنیم
# phone = input("Enter a phoneNumber: ")
# print(phone.lstrip('0'))

# # ************************************************************************************
# """
#     یک رشته را از کاربر بگیر ید و سپس تعداد جمله ها، تعداد کلمه
#     ها، تعداد کل کاراکتر ها ) مثال حروف، فاصله، نقطه، ویرگول و...( و
#     تعداد حروف انگلیسی ) مثل a، b، c و...( را چاپ کنید.
# """
# s = input("Enter a sentence: ").replace(' ','')
# for i in s:
#     print(i)

# # ************************************************************************************
s = input("Enter a character: ")
print(ord(s))