# """
#     برای بررسی اینکه یک حرف، کد یونیکد یا asciiاش چیه
#     از تابع ord استفاده میکنیم
# """
# x = 'A'
# print(ord(x))
# # ************************************************************************************
# """
#     همچنین برای فهمیدن اینکه یک کد یونیکد، چه حرفی هستش از تابع 
#     chr استفاده میکنیم
# """
# x = 65
# print(chr(65))
# # ************************************************************************************
# """
#     برای زمان هایی که یک کاراکتری توی کیبوردمون نیست، میتونیم بریم کاراکترش رو توی جدول های
#     یونیکد یا ascii پیدا کنیم و 
#     به شکل زیر با یک بک اسلش بنویسیم
#     توجه هم کنید که حروف ascii خیلی کمتر از یونیکد هستند
# """
# # از یو بزرگ برای 32 بیتی ها و از یو کوچک برای 16 بیتی ها استفاده میکنیم
# print('Char : \u0489')
# # ************************************************************************************
# """
#     کار \b پاک کردن یه حرف قبل هستش
#     در واقع همان backspace هستش
# """
# print("Hello\bWorld")

# # ************************************************************************************
# FORMATTING IN PYTHON
x = 12
y = 78.46547565663
z = "Lili"
print("x is: {}\ny is: {}\nz is: {}".format(x , y , z))