# Lets learn about lists in python
# x = [12.5, 45, ['mahsan','gilani'], 'j']
# print(x[2][0][2])           # متغیر موجود در لیست دوم چون از نوع استرینگ هستش، میتونیم براش از ایندکس ها استفاده کنیم

#---------------------------------------------------------------------------------------------------------------\
# # shallow copy --> کپی سطحی
# # deep copy --> کپی عمیق  
# # کپی از نوع عمیق حتی عناصر داخلی رو هم کپی میکنه

# l1 = [1 , 2 , ['a','b']]

# l2 = l1.copy()          # کپی سطحی

# print(id(l1))
# print(id(l2))

# l2[2][0] = 3

# print(l1)
# print(l2)

# # کپی عمیق
# import copy
# l1 = [1 , 2 , ['a','b']]

# l2 = copy.deepcopy(l1)

# l2[2][0] = 3

# print(l1)
# print(l2)
#---------------------------------------------------------------------------------------------------------------\

# # appending to list
# l1 = [12 , 13 , 14]
# l1.append(['a', 13.4, 10])
# print(l1)

#---------------------------------------------------------------------------------------------------------------\
# a , b , *c = [1, 2, 9, 7, 6, 0, 10]         # وقتی کنار یک پارامتر، برای انتساب متغیرها به متغیرهای لیست، ستاره قرار میدیم، باعث میشه که هرچی در ادامه ی لیست موند رو برای خودش برداره

# print(a)
# print(b)
# print(c)