# # start to learn sets in python
# s = {1, 5, 6, 9, 5, 5, 5, 5, 5, 5}          # مجموعه ها اعداد تکراری نمیپذیرن
# s.add(9)
# print(s)
#---------------------------------------------------------------------------
P = {3, 9, 15, 12, 6, 18}
Q = {12, 18, 6, 10, 4, 16, 2, 8, 14}
print(P-Q)
print(P.difference(Q))

print(P | Q)        # اجتماع
print(P.union(Q))

print(P & Q)        # اشتراک
print(P.intersection(Q))

print(P ^ Q)        # تفاضل متقارن، یعنی همه موارد دو مجموعه بجز مشترکاتشون
print((P | Q) - (P & Q))
print((P-Q) | (Q-P))
print(Q.symmetric_difference(P))

print(P < Q)          # برای بررسی زیرمجموعه بودن: آیا هرچیزی توی پی هست توی کیو هم هست؟
# آیا پی ساب ست کیو هست؟
print(P.issubset(Q))


print(P > Q)        # آیا پی سوپرست کیو هست؟
# یعنی آیا همه ی موارد کیو توی پی هست و پی عضوهایی داشته باشه که توی کیو نباشه
print(P.issuperset(Q))

#---------------------------------------------------------------------------

